export const dialog = {
  answer: {
    '0000': {
      dialog: [['你好', '很高兴遇见你']],
      response: [
        {
          brief: '真的吗',
          dialog: [['真的吗']],
          next: '0002'
        },
        {
          dialog: [['我也是']],
          next: '0002'
        }
      ]
    },
    '0001': {
      dialog: [['那么你想知道点什么呢'], ['你还有什么想了解点呢']]
    },
    '0002': {
      dialog: [
        ['当然了', '有人来瞅瞅当然开心了'],
        ['哈哈哈', '必须的，贼开心']
      ],
      next: '0001'
    },
    '0003': {
      dialog: [['哈哈哈哈哈哈', '真的吗']],
      next: '0001'
    },
    '0004': {
      dialog: [
        [
          '是看了羡辙的博客觉得很有趣就自己写了一个',
          '地址在这里，你可以去看一下原版',
          {
            type: 'link',
            href: 'http://zhangwenli.com/2017/'
          }
        ]
      ],
      response: [
        {
          brief: '有点像啊',
          dialog: [['这相似程度有点高呀', '不会是抄袭吧[手动滑稽]']],
          next: '0006'
        },
        {
          brief: '不错',
          dialog: [['原版很棒啊', '不过你的也很棒就是了']],
          next: '0005'
        },
        {
          brief: '之后再说',
          dialog: [['那我之后去看下', '我们聊聊其他的']],
          next: '0001'
        }
      ]
    },
    '0005': {
      dialog: [['嘻嘻嘻', '谢谢夸奖', '主要还是觉得这个很有趣']],
      next: '0001'
    },
    '0006': {
      dialog: [
        [
          '原版是用vue写的，我用react重写了一下',
          '借鉴主要还是UI上，毕竟我对设计没啥研究',
          '这个应用有趣的还是问答数据结构的设计，这个我还是有点自己的东西的',
          '红红火火恍恍惚惚'
        ]
      ],
      next: '0001'
    },
    '0007': {
      dialog: [['程序员'], ['码农']],
      next: {
        dialog: [
          ['准确点说就是前端工程师', '简单点说的话就是个画页面的，只是不用笔']
        ],
        response: [
          {
            dialog: [['哦，在哪高就呢']],
            next: '0008'
          },
          {
            dialog: [['有跳槽的打算吗']],
            next: '0008'
          }
        ]
      }
    },
    '0008': {
      dialog: [['其实我暂时是在离职状态'], ['其实我现在是无业游民哒～']],
      next: {
        dialog: [['随时欢迎勾搭~,邮件至yesifan66@qq.com(限杭州上海附近)']],
        response: [
          {
            dialog: [['哦，那你有啥优势呢']],
            next: '0009'
          },
          {
            dialog: [['好，我看看']]
          }
        ]
      }
    },
    '0009': {
      dialog: [['我觉得我还是挺厉害的哈'], ['嗯，至少打个代码啥的没啥问题']],
      next: {
        dialog: [
          [
            '我在github上还是敲了些代码的，可以瞅瞅',
            '如果有兴趣可以发我邮件，我把简历发你哟'
          ]
        ]
      }
    },
    '0010': {
      dialog: [['嗯，还不是个普通人。业余项目呗']],
      response: [
        {
          dialog: [['具体点呢']],
          next: '0011'
        }
      ]
    },
    '0011': {
      dialog: [
        ['不大好说'],
        ['算是比较宅，比较喜欢有挑战性的东西，不过太难又会放弃'],
        ['可以总结为勇于挑战又知难而退的优秀性格']
      ],
      response: [
        {
          dialog: [['有点神奇的性格呢']]
        }
      ]
    },
    '0012': {
      dialog: [
        ['嗯，爱好的话无非游戏，追剧和吃了', '很普通啊'],
        [
          '就很普通啊',
          '吃饭睡觉吃饭',
          '哈哈哈，开玩笑，不过也大不差。',
          '就游戏，追剧啥的'
        ]
      ],
      response: [
        {
          dialog: [['这能算爱好吗...']],
          next: {
            dialog: [['怎么就不能算呢！']]
          }
        }
      ]
    }
  },
  qusition: {
    work: {
      brief: '工作',
      dialog: [['你的工作是？'], ['吃饭的家伙？']],
      next: '0007'
    },
    idea: {
      brief: '创意',
      dialog: [['这个好像很有趣', '你是怎么想到的呢']],
      next: '0004'
    },
    life: {
      brief: '性格',
      dialog: [['是什么人会写这么个东西呢']],
      next: '0010'
    },
    hobby: {
      brief: '爱好',
      dialog: [['有啥业余爱好呢']],
      next: '0012'
    }
  }
};

export default dialog;
